'''
比较运算符：

以下假设变量a为10，变量b为20：
运算符	描述	                                                                                            实例
==	    等于 - 比较对象是否相等	                                                                            (a == b) 返回 False。
!=	    不等于 - 比较两个对象是否不相等	                                                                    (a != b) 返回 true.
<>	    不等于 - 比较两个对象是否不相等	                                                                    (a <> b) 返回 true。这个运算符类似 != 。
>	    大于 - 返回x是否大于y	                                                                            (a > b) 返回 False。
<	    小于 - 返回x是否小于y。所有比较运算符返回1表示真，返回0表示假。这分别与特殊的变量True和False等价。	(a < b) 返回 true。
>=	    大于等于	- 返回x是否大于等于y。	                                                                (a >= b) 返回 False。
<=	    小于等于 -	返回x是否小于等于y。	                                                                (a <= b) 返回 true。
'''
